{
  "tabTitle" : "Get Licensed",
  "pageTitle" : "Getting IAR Registered is as Easy as 1,2,3,4...",
  "description" : "With the passage of the DOL Fiduciary rule, a fee-based approach is one of the more viable options to advise on retirement accounts. Getting IAR Registered is your first step to building a DOL Compliant business.",
  "resourceStepList" : [ {
    "title" : "Why Get Licensed",
    "description" : "The Advice Industry is evolving at a rapid pace as Digital advice platforms and transformative regulatory legislation become a significant catalyst for change. Clients expect more transparency, better products and services and at reduced costs. The value chain for financial advice is experiencing a significant shift forcing the industry to embrace holistic financial planning and fee-based compensation models. This trend necessitates that advisors become IAR's to capitalize on these trends. To better understand the benefit, we wanted to provide an opportunity to directly hear from your peers that recently made the decision to become IAR registered.",
    "resourceItems" : [ {
      "type" : "ical",
      "url" : "https://myceterasmartworks.com/Public/Portal/Content.aspx?ContentId=29922210",
      "description" : "Participate: Benefits of Becoming an IAR",
      "sso" : "no"
    }, {
      "type" : "pdf",
      "url" : "https://myceterasmartworks.com/Public/Portal/Content.aspx?ContentId=29922215",
      "description" : "Read: IAR Registration FAQs",
      "sso" : "no"
    } ]
  }, {
    "title" : "Choose an Education Provider",
    "description" : "We are excited to let you know that Cetera Financial Group has negotiated substantial discounts for training on your behalf to help you plan for this change, by partnering with several leading exam preparation companies.  Use the discount to prepare for your Series 65 or 66 exam - or any securities exam!",
    "resourceItems" : [ {
      "type" : "pdf",
      "url" : "https://myceterasmartworks.com/Public/Portal/Content.aspx?ContentId=29922220",
      "description" : "Read: Training Discounts",
      "sso" : "no"
    } ]
  }, {
    "title" : "Open Your Window",
    "description" : "When you are 30 days from taking your exam, contact your Licensing & Registration team to open your exam window. Once your exam window is opened, you will have 120 days to schedule and sit for your exam.",
    "resourceItems" : null
  }, {
    "title" : "Schedule Your Exam",
    "description" : "Schedule your exam date per the instructions provided to you when you opened your exam window.",
    "resourceItems" : null
  }, {
    "title" : "Take and Pass Your Exam",
    "description" : "Show up at your scheduled appointment time to take the exam and Good Luck!",
    "resourceItems" : null
  }, {
    "title" : "Contact the DOL DynamIQs Consulting Team",
    "description" : "We are here to help, and we invite you to contact us to learn more about how you can get licensed",
    "resourceItems" : [ {
      "type" : "email",
      "url" : "dol@cetera.com",
      "description" : "Consult: DOL DynamIQs Consulting Team",
      "sso" : "no"
      },
      {
        "type": "phone",
        "url": "",
        "description": "800-771-6316",
        "sso": "no"
      }
    ]
  } ]
}
